backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Kinnari Shah"], ["created_at", "2021-02-12 01:00:34.250545"], ["updated_at", "2021-02-12 01:00:34.250545"]]
---
  def create
    @user = User.new(:name => params[:name].titleize)
    if @user.save