backend/app/controllers/api/v1/cuisines_controller.rb

SELECT "cuisines".* FROM "cuisines"
---
    def index
        cuisines = Cuisine.all