backend/app/controllers/api/v1/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("img_src", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["img_src", "food"], ["caption", "caption"], ["user_id", 1], ["created_at", "2021-02-17 16:57:06.674619"], ["updated_at", "2021-02-17 16:57:06.674619"]]