backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "kinnari shah"], ["created_at", "2021-02-17 14:54:25.474716"], ["updated_at", "2021-02-17 14:54:25.474716"]]
---
  def create
    @user = User.new(:name => params[:name].titleize)
    if @user.save